
## Plan Result

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3122306487)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * aws_ecs_service.memo_board_rs
* Update
  * aws_lb_listener.memo_board_rs
* Replace
  * aws_lb_target_group.memo_board_rs


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.memo_board_rs will be created
  + resource "aws_ecs_service" "memo_board_rs" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board"
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "memo_board_rs"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "memo_board_rs:2"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "memo_board_rs"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-033af2ba0540ee42c",
            ]
          + subnets          = [
              + "subnet-047a19359c4468354",
              + "subnet-0ae15c749b9813fb9",
              + "subnet-0f84ebfae4c920a30",
            ]
        }
    }

  # aws_lb_listener.memo_board_rs will be updated in-place
  ~ resource "aws_lb_listener" "memo_board_rs" {
        id                = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/26e500ed2f05c21e"
        tags              = {}
        # (7 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.memo_board_rs must be replaced
-/+ resource "aws_lb_target_group" "memo_board_rs" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/memo-board-rs/63ac7b39098cfb95" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95" -> (known after apply)
      + ip_address_type                    = (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "memo-board-rs"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ target_type                        = "instance" -> "ip" # forces replacement
        # (8 unchanged attributes hidden)

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":23,"Program":"tfcmt","SHA1":"32e8fc1d363bf75eeb5400aba94799c5de7b003f","Vars":{},"WorkflowName":"Terraform"} -->